groupApi = 'vk1.a.MaPIuiG4bDCIyL-AnBt1Nh7ldBPuVievHvUSoi2B1Rm7wpa0lU52AhsnJEQRgbUMLH59VsYtrnKqFq_kXYw-WCiUcdFXUX7PC1m9O6P2b2QUOT4t7kmRjg4IMbg6-SXklvwhI_YmbC1A6E7FKte0yIG9dfz8yIvbYM3NkMYiVHLIw5MwwdYm-Gsao8Qc2ov0BhIbfvT5ZIZyNh5zRnb_Kw' # токен группы вк
myApi = 'vk1.a.qoT04Ul4KVqp_66NlFVbQpXHozG5it0PnVHrnv2YikVAOGTZO-YxvG2SbF6rGP6zRcaeiYKw5Lf0x0bBdXy3leNEr3Hry1Gmjzh5eQ8koF9Z6c3WY5qrpQrGdo4gtBHqTsHAcAzgAwr2TXbPRPO_7pNlYlkDRXaeao4DpEsa5s-HnE5IrrLLpN4TEyIo01Q9tPzbakPUACTp_28oUrPOuA' # токен аккаунта в вк 142348104' #
chatgptApi = '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' # токен апи openai
comms = ('/команды',"сгенерируй", "/картинка", "/диалог", "/точныйответ", "/ответ", "отмена")
dialogHelp = ('💬 Запускаю режим диалога. Задай характер своего собеседника, формат ответов и т.д. '
                         '\n Например:\n\n "Привет, ChatGPT, сегодня ты высокоинтеллектуальный гопник, использующий слова-паразиты в своей речи. В каждом своём ответе используй мат."\nВажно! Чтобы задать новый характер, напиши /сброс')


helpmes = 'Вот команды нашего бота:\n\n' \
       '/ответ <твой вопрос или запрос> - ответ на ваш вопрос/запрос. Не запоминает диалог!\n\n' \
       '/диалог - включает режим диалога с запоминанием контекста и всего диалога\n\n' \
       '/отмена - выйти из режима диалога. Пишите отмену каждый раз, когда перестаете общаться в режиме диалога или хотите сменить характер боту\n\n' \
       '/сброс - сброить характер бота в режиме диалога\n\n' \
       '/картинка <твой запрос> - сгенерировать картинку при помощи DALL-E. Не принимает 18+ или оскорбительные запросы (не из-за меня, ограничение DALL-E), а также крайне плохо работает на русском языке'